"""
String Resourses for Soppy module
"""

HELLO_YOUR_NAME = '안녕하세요, 저는 고민 상담 챗봇 “소피" 입니다 :) 제가 입이 아~주 무겁거든요. 요즘 고민이 있다면 혼자 걱정하지 말고 저와 함께 해결해봐요.\n\n제가 당신의 이름을 뭐라고 부르면 될까요~? 이름만 적어주세요!\n예) 화진'
CONFIRM_NICKNAME = '아래의 이름이 맞나요?\n"네", "아니오"로 대답해주세요.\n[%s]'
RESPONSE_NICKNAME_YES = '네'
RESPONSE_NICKNAME_NO = '아니오'
WRONG_RESPONSE_FORMAT = '잘못된 형식의 답변입니다.'
ASK_NICKNAME_AGAIN = '그럼 뭐예요?'
OKAY_WHATS_YOUR_TROUBLE = '오홍, 좋아요! %s님, 이제 본격적으로 고민 상담을 시작해볼게요 :) 혹시 요즘 어떤 고민이 있으신가요?'
DETAILED_EXPLANATION = '아, 그런 고민을 하고 계셨군요... 저도 고민이 있어요. 누구나 다 고민이 있으니까요! 이제 차근 차근 하나씩 얘기해보도록 해요. 그 고민에 대해 좀 더 구체적으로 얘기해주실래요?'
WHAT_DID_YOU_DO = '아이구, 그런 일이 있었군요... 그동안 마음 고생했겠네요. 그래서 그 일에 대해 어떻게 했어요?'
DID_IT_WORK = '아아, 그렇군요. 그게 도움이 되나요?\n"네", "아니오"로 대답해주세요.'
DID_IT_SOLVED_YOUR_PROBLEM = '와, 그랬구나. 정말 잘 하신 것 같아요. 대단해요 :) 그리고 나서는 문제가 해결 되었나요?\n"네", "아니오"로 대답해주세요.'
WHY_DIDNT_IT_WORK = '으...이런 이런ㅠㅠ 왜 잘 안 되었나요?'
TELL_ME_AGAIN = '아...그러셨구나. 그랬을 수도 있을 것 같아요. 그 마음 이해해요. 그 일에 대해 더 얘기해볼래요?'
HOW_ABOUT_FRIENDS = '아하, 그렇군요! 그럼 혹시 지금 본인과 같은 상황을 겪고 있는 친구가 있다면 어떤 말을 해주고 싶나요?'
NOW_ALL_SOLVED = '우와~좋은 얘기 감사해요 :) 다른 분들도 이 얘기에 공감할 것 같아요. 이제 고민 해결에 좀 도움이 되었나요?\n"네", "아니오"로 대답해주세요.'
ALL_SOLVED_GOOD = '오, 다행이다!ㅠㅠ %s님이 계속 고민하는 모습이 보기 좋았어요. 무엇이든 고민하고 함께 얘기하다 보면 잘 해결할 수 있을 거예요. 그럼 다음에 또 만나요 :)'
ALL_SOLVED_BAD = '음... 아직은 속상하고 답답하겠지만, 차근 차근 잘 해결할 수 있을 거예요. 다음 시간에는 문제를 좀 더 세분화해서 함께 살펴보도록 해요 :) 오늘도 수고하셨어요!'
EXPERIMENT_END = '이제 실험이 끝났으니, 휴대폰을 테이블에 내려놓고 연구자의 안내를 기다려주세요.'
